### **[데이터 전처리]**

- 라이브러리 호출

In [1]:
import re 
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from datetime import datetime
import random
plt.rc('font', family='NanumMyeongjo')

- 데이터 호출

In [2]:
user_colums = ['user_id', 'gender', 'age', 'occupation', 'zip']
rating_columns = ['user_id', 'movie_id', 'rating', 'timestamp']
movie_columns = ['movie_id', 'title', 'genres']

In [4]:
data_path = './autoint/ml-1m'

In [5]:
users = pd.read_csv(f'{data_path}/users.dat', sep='::', header=None, names=user_colums, engine='python')
ratings = pd.read_csv(f'{data_path}/ratings.dat', sep='::', header=None, names=rating_columns, engine='python')
movies = pd.read_csv(f'{data_path}/movies.dat', sep='::', header=None, names=movie_columns, engine='python', encoding='latin-1')

- 데이터: users

In [6]:
print(users.shape)
users.head()

(6040, 5)

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

- 데이터: movies

In [7]:
print(movies.shape)
movies.head()

(3883, 3)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [9]:
# 연도 추출
movies['movie_year'] = movies['title'].str.extract(r'\((\d{4})\)')
movies.head()

,movie_id,title,genres,movie_year
0,1,Toy Story (1995),Animation|Children's|Comedy,1995
1,2,Jumanji (1995),Adventure|Children's|Fantasy,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,1995
3,4,Waiting to Exhale (1995),Comedy|Drama,1995
4,5,Father of the Bride Part II (1995),Comedy,1995

In [12]:
# 연대 추출
movies['movie_decade'] = movies['title'].str.extract(r'\((\d{4})\)')[0].astype(int).apply(lambda x: str(x - (x % 10)) + 's')
movies['title'] = movies['title'].apply(lambda x: re.sub(r'\s*\(\d{4}\)', '', x))

ValueError: cannot convert float NaN to integer

In [13]:
movies.head()

,movie_id,title,genres,movie_year,movie_decade
0,1,Toy Story,Animation|Children's|Comedy,1995,1990s
1,2,Jumanji,Adventure|Children's|Fantasy,1995,1990s
2,3,Grumpier Old Men,Comedy|Romance,1995,1990s
3,4,Waiting to Exhale,Comedy|Drama,1995,1990s
4,5,Father of the Bride Part II,Comedy,1995,1990s

In [14]:
# | 기준으로 장르 데이터를 분리 
genres_split = movies['genres'].str.split('|')

In [15]:
max_genres = genres_split.apply(len).max() 

# 각 장르별로 새로운 컬럼을 생
for i in range(max_genres):
    movies[f'genre{i + 1}'] = genres_split.apply(lambda x: x[i] if i < len(x) else None)

# 기존 장르 컬럼 제거
movies.drop('genres', axis=1, inplace=True)

# None은 공백
movies.fillna('', inplace=True)

In [16]:
print(movies.shape)
movies.head()

(3883, 10)

,movie_id,title,movie_year,movie_decade,genre1,genre2,genre3,genre4,genre5,genre6
0,1,Toy Story,1995,1990s,Animation,Children's,Comedy,,,
1,2,Jumanji,1995,1990s,Adventure,Children's,Fantasy,,,
2,3,Grumpier Old Men,1995,1990s,Comedy,Romance,,,,
3,4,Waiting to Exhale,1995,1990s,Comedy,Drama,,,,
4,5,Father of the Bride Part II,1995,1990s,Comedy,,,,,

In [17]:
set(movies['genre1'].unique().tolist() + movies['genre2'].unique().tolist() + movies['genre3'].unique().tolist())

{'',
 'Action',
 'Adventure',
 'Animation',
 "Children's",
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Fantasy',
 'Film-Noir',
 'Horror',
 'Musical',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western'}

- 데이터: ratings

In [8]:
print(ratings.shape)
ratings.head()

(1000209, 4)

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [18]:
# Unix > 연월일 
ratings['timestamp'] = ratings['timestamp'].apply(lambda x : datetime.fromtimestamp(x).strftime("%Y-%m-%d"))
ratings.head()

   user_id  movie_id  rating   timestamp
0        1      1193       5  2001-01-01
1        1       661       3  2001-01-01
2        1       914       3  2001-01-01
3        1      3408       4  2001-01-01
4        1      2355       5  2001-01-07

In [19]:
ratings['rating_year'] = ratings['timestamp'].apply(lambda x : x.split("-")[0]) 
ratings['rating_month'] = ratings['timestamp'].apply(lambda x : x.split("-")[1])
ratings['rating_decade'] = ratings['rating_year'].astype(int).apply(lambda x: str(x - (x % 10)) + 's')

In [20]:
ratings.head()

,user_id,movie_id,rating,timestamp,rating_year,rating_month,rating_decade
0,1,1193,5,2001-01-01,2001,01,2000s
1,1,661,3,2001-01-01,2001,01,2000s
2,1,914,3,2001-01-01,2001,01,2000s
3,1,3408,4,2001-01-01,2001,01,2000s
4,1,2355,5,2001-01-07,2001,01,2000s

- 전처리 데이터 저장

In [ ]:
# movies.to_csv(f"{data_path}/movies_prepro.csv", index=False)
# ratings.to_csv(f"{data_path}/ratings_prepro.csv", index=False)
# users.to_csv(f"{data_path}/users_prepro.csv", index=False)

### **[모델 입력 데이터 생성: 랜덤 샘플링 기반]**

- ratings 통해 선호 데이터 추출: 3점 이상인 경우 선호한다고 가정(label = 1)
- 비선호 데이터 추출: 선호하지 않은 영화 리스트 중, 선호 영화 1개당 5개의 비선호 영화 추출(label = 0)

In [22]:
# label = 1
ratings = ratings[ratings['rating'] >= 3]
ratings['label'] = 1
ratings.drop('rating', axis=1, inplace=True)
print(ratings.shape)
ratings.head()

(836478, 7)

   user_id  movie_id   timestamp rating_year rating_month rating_decade  label
0        1      1193  2001-01-01        2001           01         2000s      1
1        1       661  2001-01-01        2001           01         2000s      1
2        1       914  2001-01-01        2001           01         2000s      1
3        1      3408  2001-01-01        2001           01         2000s      1
4        1      2355  2001-01-07        2001           01         2000s      1

In [23]:
# 사용자가 선호했던 영화 리스트 추출
user_seen_movies = ratings.groupby('user_id')['movie_id'].apply(list).reset_index()
user_seen_movies.head()

   user_id                                           movie_id
0        1  [1193, 661, 914, 3408, 2355, 1197, 1287, 2804,...
1        2  [1357, 3068, 1537, 647, 2194, 648, 2268, 2628,...
2        3  [3421, 648, 1394, 3534, 104, 2735, 1210, 1431,...
3        4  [3468, 1210, 2951, 1214, 1036, 260, 2028, 480,...
4        5  [2987, 2333, 1175, 39, 2337, 1535, 1392, 1466,...

In [24]:
unique_movies = movies['movie_id'].unique()
unique_users = users['user_id'].unique()
negative_users = []
negative_movies = []
negative_labels = []

for user in unique_users:
    
    if len(user_seen_movies[user_seen_movies['user_id'] == user]) < 1:      # 충분한 이력이 없는 사용자 제외. 
        continue
    user_seen_movie_list = user_seen_movies[user_seen_movies['user_id'] == user]['movie_id'].values[0]
    user_non_seen_movie_list = list(set(unique_movies) - set(user_seen_movie_list))

    sample_pop_size = len(user_seen_movie_list)*5
    if len(unique_movies) - len(user_seen_movie_list) < len(user_seen_movie_list)*5 :
        sample_pop_size = len(unique_movies) - len(user_seen_movie_list)

    user_negative_movie_list = random.sample(user_non_seen_movie_list, sample_pop_size)
    
    negative_users += [user for _ in range(len(user_negative_movie_list))]
    negative_movies += user_negative_movie_list
    negative_labels += [0 for _ in range(len(user_negative_movie_list))]

In [25]:
print(len(negative_users))
print(len(negative_movies))
print(len(negative_labels))

4068124
4068124
4068124

In [26]:
negative_ratings_df = pd.DataFrame({'user_id' : negative_users, 'movie_id' : negative_movies, 'label':negative_labels})
print(negative_ratings_df.shape)
negative_ratings_df.head()

(4068124, 3)

   user_id  movie_id  label
0        1      3597      0
1        1      3366      0
2        1      1375      0
3        1      3124      0
4        1      2768      0

- 모델 입력 데이터 병합

In [27]:
# 필요 칼럼만 추출
ratings_df = ratings[['user_id', 'movie_id', 'label']] 
ratings_df = pd.concat([ratings_df, negative_ratings_df], axis=0)
movies_df = movies[['movie_id', 'movie_decade', 'movie_year', 'genre1']]
movies_df.columns = ['movie_id', 'decade', 'movie_year', 'genre']
user_df = users[['user_id', 'gender', 'age', 'occupation', 'zip']]

In [ ]:
merge_mlens_data = pd.merge(ratings_df, movies_df, on='movie_id')
merge_mlens_data = pd.merge(merge_mlens_data, user_df, on='user_id')
merge_mlens_data.dropna(inplace=True)
print(merge_mlens_data.shape)
merge_mlens_data.head()

(4904602, 10)

,user_id,movie_id,label,decade,movie_year,genre,gender,age,occupation,zip
0,1,1193,1,1970s,1975,Drama,F,1,10,48067
1,1,661,1,1990s,1996,Animation,F,1,10,48067
2,1,914,1,1960s,1964,Musical,F,1,10,48067
3,1,3408,1,2000s,2000,Drama,F,1,10,48067
4,1,2355,1,1990s,1998,Animation,F,1,10,48067

In [29]:
merge_mlens_data = merge_mlens_data[['user_id', 'movie_id','decade', 'movie_year', 'genre', 'gender', 'age', 'occupation', 'zip', 'label']]
print(merge_mlens_data.shape)
merge_mlens_data.head()

(4904602, 10)

,user_id,movie_id,decade,movie_year,genre,gender,age,occupation,zip,label
0,1,1193,1970s,1975,Drama,F,1,10,48067,1
1,1,661,1990s,1996,Animation,F,1,10,48067,1
2,1,914,1960s,1964,Musical,F,1,10,48067,1
3,1,3408,2000s,2000,Drama,F,1,10,48067,1
4,1,2355,1990s,1998,Animation,F,1,10,48067,1

- 모델 입력 데이터 저장

In [ ]:
# merge_mlens_data.to_csv(f'{data_path}/movielens_rcmm_random.csv', index=False)

### **[모델 입력 데이터 생성: 선호도 기반]**

- 평점 4점 이상 데이터를 선호(label = 1)
- 그 외(label = 0)

In [31]:
users_df = pd.read_csv(f'{data_path}/users_prepro.csv')
ratings_df = pd.read_csv(f'{data_path}/ratings_prepro.csv')
movies_df = pd.read_csv(f'{data_path}/movies_prepro.csv')

In [32]:
print(users_df.columns)
print(ratings_df.columns)
print(movies_df.columns)

Index(['user_id', 'gender', 'age', 'occupation', 'zip'], dtype='object')
Index(['user_id', 'movie_id', 'rating', 'timestamp', 'rating_year',
       'rating_month', 'rating_decade'],
      dtype='object')
Index(['movie_id', 'title', 'movie_year', 'movie_decade', 'genre1', 'genre2',
       'genre3', 'genre4', 'genre5', 'genre6'],
      dtype='object')

In [33]:
ratings_df['label'] = ratings_df['rating'].apply(lambda x : x >=4).astype(int)

ratings_df = ratings_df[['user_id', 'movie_id', 'rating_year','rating_month', 'rating_decade', 'label']]
ratings_df.head()

   user_id  movie_id  rating_year  rating_month rating_decade  label
0        1      1193         2001             1         2000s      1
1        1       661         2001             1         2000s      0
2        1       914         2001             1         2000s      0
3        1      3408         2001             1         2000s      1
4        1      2355         2001             1         2000s      1

- 모델 입력 데이터 병합

In [ ]:
# 필요 칼럼만 추출
movies_df = movies_df[['movie_id', 'movie_decade', 'movie_year', 'genre1', 'genre2', 'genre3']]
users_df = users_df[['user_id', 'gender', 'age', 'occupation', 'zip']]

In [34]:
merge_mlens_data = pd.merge(ratings_df, movies_df, on='movie_id')
merge_mlens_data = pd.merge(merge_mlens_data, users_df, on='user_id')
merge_mlens_data.fillna('no', inplace=True)
print(merge_mlens_data.shape)
merge_mlens_data.head()

(1000209, 19)

,user_id,movie_id,rating_year,rating_month,rating_decade,label,title,movie_year,movie_decade,genre1,genre2,genre3,genre4,genre5,genre6,gender,age,occupation,zip
0,1,1193,2001,1,2000s,1,One Flew Over the Cuckoo's Nest,1975,1970s,Drama,no,no,no,no,no,F,1,10,48067
1,1,661,2001,1,2000s,0,James and the Giant Peach,1996,1990s,Animation,Children's,Musical,no,no,no,F,1,10,48067
2,1,914,2001,1,2000s,0,My Fair Lady,1964,1960s,Musical,Romance,no,no,no,no,F,1,10,48067
3,1,3408,2001,1,2000s,1,Erin Brockovich,2000,2000s,Drama,no,no,no,no,no,F,1,10,48067
4,1,2355,2001,1,2000s,1,"Bug's Life, A",1998,1990s,Animation,Children's,Comedy,no,no,no,F,1,10,48067

In [35]:
merge_mlens_data = merge_mlens_data[['user_id', 'movie_id','movie_decade', 'movie_year', 'rating_year', 'rating_month', 'rating_decade', 'genre1','genre2', 'genre3', 'gender', 'age', 'occupation', 'zip', 'label']]
print(merge_mlens_data.shape)
merge_mlens_data.head()

(1000209, 15)

,user_id,movie_id,movie_decade,movie_year,rating_year,rating_month,rating_decade,genre1,genre2,genre3,gender,age,occupation,zip,label
0,1,1193,1970s,1975,2001,1,2000s,Drama,no,no,F,1,10,48067,1
1,1,661,1990s,1996,2001,1,2000s,Animation,Children's,Musical,F,1,10,48067,0
2,1,914,1960s,1964,2001,1,2000s,Musical,Romance,no,F,1,10,48067,0
3,1,3408,2000s,2000,2001,1,2000s,Drama,no,no,F,1,10,48067,1
4,1,2355,1990s,1998,2001,1,2000s,Animation,Children's,Comedy,F,1,10,48067,1

- 모델 입력 데이터 저장

In [36]:
merge_mlens_data.to_csv(f'{data_path}/movielens_rcmm_rating.csv', index=False)